//------------------------------------------------------------------------------
// car.cpp - содержит функции обработки легкового автомобиля
//------------------------------------------------------------------------------

#include "car.h"

Random Car::rnd100(1, 100);

//------------------------------------------------------------------------------
// Ввод параметров автомобиля из файла
void Car::In(FILE *fp) {
    fscanf(fp, "%hd%d%f", maxSpeed, fuelCapacity, fuelConsumption);
}

// Случайный ввод параметров автомобиля
void Car::InRnd() {
    maxSpeed = rnd100.Get() + 90;
}

//------------------------------------------------------------------------------
// Вывод параметров автомобился в файл
void Car::Out(FILE *fp) {
    fprintf(fp, "%s%d%s%d%s%.2f%s%.2f", "It is a car: max speed = ", maxSpeed,
            ", fuel capacity = ", fuelCapacity,
            ", fuel consumption = ", fuelConsumption,
            ". Max distance = ", Distance());
}

//------------------------------------------------------------------------------
// Вычисление маскимального расстояния
double Car::Distance() {
    return fuelCapacity / fuelConsumption * 100;
}
